/*
Задача odd2

Условие задачи
Считать с клавиатуры два целых числа, причём второе число не меньше первого.
Вывести в строку все нечётные числа в промежутке от первого до второго включительно.
В указанном промежутке гарантируется на вывод хотя бы одно число.

Пример ввода
7 15
Пример вывода
7 9 11 13 15

*/

#include <stdio.h>

int main()
{
    unsigned int min, max;
    scanf("%u %u", &min, &max);

    while (min <= max)
    {
        ((min % 2) == 1) && printf("%u ", min);
        min++;
    }
	return 0;
}
